import {
	Advantage,
	Brand,
	Feedback,
	Master,
	Work,
} from '@/types';

export const advantages: Advantage[] = [
	{
		id: 1,
		title: 'Бесплатное диагностика',
		body: 'Наши мастера обладают высокой квалификацией и опытом в области ремонта бытовой техники.',
		imgSrc: 'icons/diagnostic-icon.svg',
		type: 1,
	},
	{
		id: 2,
		title: 'Профи мастеры',
		body: 'Наши мастера обладают высокой квалификацией и опытом в области ремонта бытовой техники.',
		imgSrc: 'icons/people-icon-2-white.svg',
		type: 2,
	},
	{
		id: 3,
		title: 'Отзывы клиентов',
		body: 'Наши клиенты доверяют нам, оставляя положительные отзывы, которые подтверждают качество наших услуг.',
		imgSrc: 'icons/message-icon.svg',
		type: 1,
	},
	{
		id: 4,
		title: 'Гарантия качества',
		body: 'Предоставляем гарантию на выполненные работы и установленные запчасти, обеспечивая долгосрочную надежность ремонта на год.',
		imgSrc: 'icons/guard-icon.svg',
		type: 1,
	},
];

export const brands: Brand[] = [
	{
		id: 1,
		imgSrc: 'brands/midea.svg',
	},
	{
		id: 2,
		imgSrc: 'brands/lg.svg',
	},
	{
		id: 3,
		imgSrc: 'brands/beko.svg',
	},
	{
		id: 4,
		imgSrc: 'brands/bosch.svg',
	},
	{
		id: 5,
		imgSrc: 'brands/elecrtrolux.svg',
	},
	{
		id: 6,
		imgSrc: 'brands/samsung.svg',
	},
	{
		id: 7,
		imgSrc: 'brands/indesit.svg',
	},
];

export const feedbacks: Feedback[] = [
	{
		id: 1,
		title: 'Xорошо',
		body: 'Спасибо большое за хороший сервис и оперативность!',
		name: 'Анель',
		date: '28.11.2023',
	},
	{
		id: 2,
		title: 'Xорошо',
		body: 'Мастера на все руки. Осталась довольна ремонтом стиральной машины. Недолго и качественно. Спасибо!',
		name: 'Анель',
		date: '28.11.2023',
	},
	{
		id: 3,
		title: 'Xорошо',
		body: 'Мастера на все руки. Осталась довольна ремонтом стиральной машины. Недолго и качественно. Спасибо!',
		name: 'Анель',
		date: '28.11.2023',
	},
	{
		id: 4,
		title: 'Xорошо',
		body: 'Мастера на все руки. Осталась довольна ремонтом стиральной машины. Недолго и качественно. Спасибо!',
		name: 'Анель',
		date: '28.11.2023',
	},
	{
		id: 5,
		title: 'Xорошо',
		body: 'Мастера на все руки. Осталась довольна ремонтом стиральной машины. Недолго и качественно. Спасибо!',
		name: 'Анель',
		date: '28.11.2023',
	},
	{
		id: 6,
		title: 'Xорошо',
		body: 'Мастера на все руки. Осталась довольна ремонтом стиральной машины. Недолго и качественно. Спасибо!',
		name: 'Анель',
		date: '28.11.2023',
	},
	{
		id: 7,
		title: 'Xорошо',
		body: 'Мастера на все руки. Осталась довольна ремонтом стиральной машины. Недолго и качественно. Спасибо!',
		name: 'Анель',
		date: '28.11.2023',
	},
	{
		id: 8,
		title: 'Xорошо',
		body: 'Мастера на все руки. Осталась довольна ремонтом стиральной машины. Недолго и качественно. Спасибо!',
		name: 'Анель',
		date: '28.11.2023',
	},
	{
		id: 9,
		title: 'Xорошо',
		body: 'Мастера на все руки. Осталась довольна ремонтом стиральной машины. Недолго и качественно. Спасибо!',
		name: 'Анель',
		date: '28.11.2023',
	},
	{
		id: 10,
		title: 'Xорошо',
		body: 'Мастера на все руки. Осталась довольна ремонтом стиральной машины. Недолго и качественно. Спасибо!',
		name: 'Анель',
		date: '28.11.2023',
	},
];

export const masters: Master[] = [
	{
		id: 1,
		name: 'Андрей',
		body: 'Цена договорная Стиральная машина, холодильник',
		location: '2.7 км от вас',
		experience: '3 года',
		imgSrc: 'human-test.svg',
	},
	{
		id: 2,
		name: 'Андрей',
		body: 'Цена договорная Стиральная машина, холодильник',
		location: '2.7 км от вас',
		experience: '3 года',
		imgSrc: 'human-test.svg',
	},
	{
		id: 3,
		name: 'Андрей',
		body: 'Цена договорная Стиральная машина, холодильник',
		location: '2.7 км от вас',
		experience: '3 года',
		imgSrc: 'human-test.svg',
	},
	{
		id: 4,
		name: 'Андрей',
		body: 'Цена договорная Стиральная машина, холодильник',
		location: '2.7 км от вас',
		experience: '3 года',
		imgSrc: 'human-test.svg',
	},
	{
		id: 5,
		name: 'Андрей',
		body: 'Цена договорная Стиральная машина, холодильник',
		location: '2.7 км от вас',
		experience: '3 года',
		imgSrc: 'human-test.svg',
	},
	{
		id: 6,
		name: 'Андрей',
		body: 'Цена договорная Стиральная машина, холодильник',
		location: '2.7 км от вас',
		experience: '3 года',
		imgSrc: 'human-test.svg',
	},
	{
		id: 7,
		name: 'Андрей',
		body: 'Цена договорная Стиральная машина, холодильник',
		location: '2.7 км от вас',
		experience: '3 года',
		imgSrc: 'human-test.svg',
	},
	{
		id: 8,
		name: 'Андрей',
		body: 'Цена договорная Стиральная машина, холодильник',
		location: '2.7 км от вас',
		experience: '3 года',
		imgSrc: 'human-test.svg',
	},
	{
		id: 9,
		name: 'Андрей',
		body: 'Цена договорная Стиральная машина, холодильник',
		location: '2.7 км от вас',
		experience: '3 года',
		imgSrc: 'human-test.svg',
	},
];

export const works: Work[] = [
	{
		id: 1,
		title: 'Звонок или Сообщение',
		body: 'Звоните или напишите нам прямо сейчас и закажите бесплатный выезд мастера на дом по Алмате',
	},
	{
		id: 2,
		title: 'Консультанция',
		body: 'Мы прокунсультируем вас о возможном ремонте вашей бытовой технике. Также узнайте стоимость ремонта заранее !',
	},
	{
		id: 3,
		title: 'Выезд мастера',
		body: 'Мастер выезжает на дом в удобное для вас время',
	},
	{
		id: 4,
		title: 'Результат и Гарантия',
		body: 'Качественный ремонт обеспечен, гарантия от 6 месяцев до 1 года.',
	},
];

export const moreAboutCompany = [
	{
		id: 1,
		title: 'Миссия и Ценности',
		body: 'Наша миссия - предоставлять высококачественные и надежные услуги по ремонту, создавая комфорт в каждом доме. Мы ценим профессионализм, прозрачность и индивидуальный подход к каждому клиенту.',
		imgSrc: 'icons/mission-icon.svg',
		type: 1,
	},
	{
		id: 2,
		title: 'Цели Компании',
		body: 'Мы стремимся быть лучшими в своей области, обеспечивая нашим клиентам быстрый и эффективный ремонт, а также выдающийся уровень обслуживания.',
		imgSrc: 'icons/goal-icon.svg',
		type: 2,
	},
	{
		id: 3,
		title: 'Наши Мастера',
		body: 'Наша команда состоит из квалифицированных мастеров, прошедших строгий отбор и обучение. Их опыт и профессионализм гарантируют, что ваша техника находится в надежных руках.',
		imgSrc: 'icons/people-icon-2-black.svg',
		type: 1,
	},
	{
		id: 4,
		title: 'Миссия и Ценности',
		body: 'Предоставляем гарантию на выполненные работы и установленные запчасти, обеспечивая долгосрочную надежность ремонта на год.',
		imgSrc: 'icons/guard-icon.svg',
		type: 1,
	},
];

export const certificates = [
	{
		id: 1,
		imgSrc: 'certificates/certificate-1.svg',
	},
	{
		id: 2,
		imgSrc: 'certificates/certificate-2.svg',
	},
	{
		id: 3,
		imgSrc: 'certificates/certificate-1.svg',
	},
	{
		id: 4,
		imgSrc: 'certificates/certificate-2.svg',
	},
	{
		id: 5,
		imgSrc: 'certificates/certificate-1.svg',
	},
	{
		id: 6,
		imgSrc: 'certificates/certificate-2.svg',
	},
	{
		id: 7,
		imgSrc: 'certificates/certificate-1.svg',
	},
];
