export const advantages = [
	{
    id: 1,
		title: 'Бесплатное диагностика',
		body: 'Наши мастера обладают высокой квалификацией и опытом в области ремонта бытовой техники.',
		imgSrc: 'icons/diagnostic-icon.svg',
    type: 1
	},
	{
    id: 2,
		title: 'Профи мастеры',
		body: 'Наши мастера обладают высокой квалификацией и опытом в области ремонта бытовой техники.',
		imgSrc: 'icons/people-icon-2.svg',
    type: 2
  },
	{
    id: 3,
		title: 'Отзывы клиентов',
		body: 'Наши клиенты доверяют нам, оставляя положительные отзывы, которые подтверждают качество наших услуг.',
		imgSrc: 'icons/message-icon.svg',
    type: 1
  },
	{
    id: 4,
		title: 'Гарантия качества',
		body: 'Предоставляем гарантию на выполненные работы и установленные запчасти, обеспечивая долгосрочную надежность ремонта на год.',
		imgSrc: 'icons/guard-icon.svg',
    type: 1
  },
];
