export const works = [
	{
		title: 'Звонок или Сообщение',
		body: 'Звоните или напишите нам прямо сейчас и закажите бесплатный выезд мастера на дом по Алмате',
	},
	{
		title: 'Консультанция',
		body: 'Мы прокунсультируем вас о возможном ремонте вашей бытовой технике. Также узнайте стоимость ремонта заранее !',
	},
	{
		title: 'Выезд мастера',
		body: 'Мастер выезжает на дом в удобное для вас время',
	},
	{
		title: 'Результат и Гарантия',
		body: 'Качественный ремонт обеспечен, гарантия от 6 месяцев до 1 года.',
	},
];
